PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_nist_p.c
/*******************************************************************************
* \file cy_cryptolite_nist_p.c
* \version 2.80
*
* \brief
*  This file provides Elliptic Curve (EC) Scalar Multiplication using (X,Y)-only,
*  Co-Z arithmetic in the Crypto driver.
*
********************************************************************************
* Copyright 2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_cryptolite_vu.h"
#include "cy_cryptolite_nist_p.h"

#if (CRYPTOLITE_VU_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_ECP_C)

/*******************************************************************************
* Elliptic Curve (EC) Scalar Multiplication using (X,Y)-only, Co-Z arithmetic
*
* Theoretic and algorithmic references:
* Algorithms and Co-Z arithmetic theory: 'Fast and Regular Algorithms for Scalar
* Multiplication over Elliptic Curves', Matthieu Rivain NIST P-curves
* (parameters and curve-specific modular reduction):
* 'RECOMMENDED ELLIPTIC CURVES FOR FEDERAL GOVERNMENT USE', NIST, 1999
*
* Useful resources:
* Large number calculator and converter:
* - http://www.mobilefish.com/services/big_number/big_number.php
* - https://www.mobilefish.com/services/big_number_equation/big_number_equation.php
*
* - ECC curves and test vectors: http://point-at-infinity.org/ecc/nisttv
*
* Valid values for scalar multiplier, 2 < d < (order-1)
*
*******************************************************************************/
#include "cy_cryptolite_vu.h"

/***************************************************************
*                   Global Variables
***************************************************************/
// static cy_en_cryptolite_ecc_curve_id_t cryptolite_eccMode;
//static cy_en_cryptolite_ecc_red_mul_algs_t cryptolite_mul_red_alg_select = CY_CRYPTOLITE_NIST_P_BARRETT_RED_ALG;

/* Barrett reduction z = x % mod */
void Cy_Cryptolite_EC_Bar_MulRed(CRYPTOLITE_Type *base,
                                 cy_stc_cryptolite_context_ecdsa_t *cfContext,
                                 uint8_t *p_z,         //   bit_size
                                 uint8_t *p_x,         //   bit_size
                                 uint32_t bit_size)
{
    uint32_t sign;
    CY_ALIGN(4) uint8_t p_t_double[VU_BITS_TO_BYTES(2U * BIT_SIZE)];     // 2*bit_size
    CY_ALIGN(4) uint8_t t2_plus2[VU_BITS_TO_BYTES(BIT_SIZE + 2U+1U)];     //   bit_size + 3

    uint8_t *p_temp_plus2;//temp_plus2;
    uint8_t *p_t1_plus2 = p_t_double;//t1_plus2;
    uint8_t *p_t2_plus2 = t2_plus2;
    uint8_t *my_P = cfContext->my_P;
    uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
    uint8_t *p_t1 = p_t2_plus2;

    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];

    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct0, p_z, VU_BITS_TO_WORDS(bit_size), p_x, VU_BITS_TO_WORDS(2U * bit_size), bit_size);

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct1, p_t_double, VU_BITS_TO_WORDS(2U * bit_size), p_z, VU_BITS_TO_WORDS(bit_size), my_BARRETT_U, VU_BITS_TO_WORDS(bit_size + 1U));
    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct0, p_t1, VU_BITS_TO_WORDS(bit_size), p_t_double, VU_BITS_TO_WORDS(2U * bit_size), bit_size);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct1, p_t_double, VU_BITS_TO_WORDS(2U * bit_size), p_t1, VU_BITS_TO_WORDS(bit_size), my_P, VU_BITS_TO_WORDS(bit_size));

    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, p_t2_plus2, VU_BITS_TO_WORDS(bit_size + 2U+1U), p_x, VU_BITS_TO_WORDS(bit_size + 2U+1U), p_t_double, VU_BITS_TO_WORDS(bit_size + 2U+1U));
    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, p_t1_plus2, VU_BITS_TO_WORDS(bit_size + 2U+1U), p_t2_plus2, VU_BITS_TO_WORDS(bit_size + 2U), my_P, VU_BITS_TO_WORDS(bit_size));
    Cy_Cryptolite_Vu_wait_hw(base);
    sign =  Cy_Cryptolite_Vu_get_bit(p_t1_plus2, bit_size + 2U);

    if ((bool)sign)
    {
        p_temp_plus2 = p_t2_plus2;
        p_t2_plus2 = p_t1_plus2;
        p_t1_plus2 = p_temp_plus2;
    }
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct1, p_z, VU_BITS_TO_WORDS(bit_size), p_t1_plus2, VU_BITS_TO_WORDS(bit_size + 3U), my_P, VU_BITS_TO_WORDS(bit_size));
}

/*------------------------------------------------------
// Multiplication reduction algorithm select
//------------------------------------------------------
*/
void Cryptolite_EC_MulRed(CRYPTOLITE_Type *base,
                          cy_stc_cryptolite_context_ecdsa_t *cfContext,
                          uint8_t *z,
                          uint8_t *x,
                          int size);
void Cryptolite_EC_MulRed(CRYPTOLITE_Type *base,
                          cy_stc_cryptolite_context_ecdsa_t *cfContext,
                          uint8_t *z,
                          uint8_t *x,
                          int size)
{

    Cy_Cryptolite_EC_Bar_MulRed(base, cfContext, z, x, (uint32_t)size);
}

/*
 @brief Modular multiplication in GF(p).
 z = a * b % mod

 Leaf function.

 @param[in] z Register index for product value.
 @param[in] a Register index for multiplicand value.
 @param[in] b Register index for multiplier value.
 @param[in] barrett_u Register index for Barrett reduction value.
 @param[in] mod Register index for modulo value.
 @param[in] size Bit size.
*/
void Cy_Cryptolite_EC_MulMod(CRYPTOLITE_Type *base,
                             cy_stc_cryptolite_context_ecdsa_t *cfContext,
                             uint8_t *z,
                             uint8_t *a,
                             uint8_t *b,
                             int size)
{

