PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_nist_p.c
    CY_ALIGN(4) uint8_t ab_double[VU_BITS_TO_BYTES(2U * BIT_SIZE)]; // the variable size is ignored
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, ab_double, VU_BITS_TO_WORDS(2U * (uint32_t)size), a, VU_BITS_TO_WORDS((uint32_t)size), b, VU_BITS_TO_WORDS((uint32_t)size));
    /* Modular Reduction: Barrett reduction or curve-specific or shift-multiply */
    Cryptolite_EC_MulRed(base, cfContext, z, ab_double, (int)size);
}

/*
 @brief Modular squaring in GF(p).
 z = a * a % mod

 @param[in] z Register index for product value.
 @param[in] a Register index for multiplicand and multiplier value.
 @param[in] barrett_u Register index for Barrett reduction value.
 @param[in] mod Register index for modulo value.
 @param[in] size Bit size.
*/
void Cy_Cryptolite_EC_SquareMod(CRYPTOLITE_Type *base,
                                cy_stc_cryptolite_context_ecdsa_t *cfContext,
                                uint8_t *z,
                                uint8_t *a,
                                int size)
{
    Cy_Cryptolite_EC_MulMod(base, cfContext, z, a, a, size);
}

/*
 @brief Modular division in GF(p).
 z = a / b % mod

 This algorithm works when "dividend" and "divisor" are relatively prime,
 Reference: "From Euclid's GCD to Montgomery Multiplication to the Great Divide", S.C. Schantz
 @param[in] z Register index for quotient value.
 @param[in] a Register index for dividend value.
 @param[in] b Register index for divisor value.
 @param[in] mod Register index for modulo value.
 @param[in] size Bit size.
*/
void Cy_Cryptolite_EC_DivMod(CRYPTOLITE_Type *base,
                             cy_stc_cryptolite_context_ecdsa_t *cfContext,
                             uint8_t *z,
                             uint8_t *a,
                             uint8_t *b,
                             int size)
{
    //uint16_t status;
    bool zero;
    bool sign;
    bool a_even;
    bool b_even;
    uint16_t wordsize = VU_BITS_TO_WORDS((uint16_t)size);
    uint16_t wordsize1 = VU_BITS_TO_WORDS((uint16_t)size + 1U);

    CY_ALIGN(4) uint8_t my_a[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_b[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_v[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t temp[VU_BITS_TO_BYTES(BIT_SIZE + 1U)];

    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];
    uint8_t *my_P = cfContext->my_P;

    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, my_a, wordsize, b, wordsize);
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, my_b, wordsize, my_P, wordsize);
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, z, wordsize, a, wordsize);

    Cy_Cryptolite_Vu_wait_hw(base);
    Cy_Cryptolite_Vu_clr(my_v, wordsize);

    while ((bool)1)
    {
        (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, temp, wordsize1, my_a, wordsize, my_b, wordsize);
        Cy_Cryptolite_Vu_wait_hw(base);

        sign = (bool)Cy_Cryptolite_Vu_get_bit(temp, (uint32_t)size);
        zero = Cy_Cryptolite_Vu_test_zero(base, vu_struct1, temp, (uint16_t)size);

        a_even = Cy_Cryptolite_Vu_test_even(my_a);
        b_even = Cy_Cryptolite_Vu_test_even(my_b);



        if (zero)
        {
            break;
        }

        if (a_even)
        {
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct1, my_a, wordsize, my_a, wordsize);
            Cy_Cryptolite_EC_HalfMod(base, cfContext, z, z);

        }
        else if (b_even)
        {
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct0, my_b, wordsize, my_b, wordsize);
            Cy_Cryptolite_EC_HalfMod(base, cfContext, my_v, my_v);

        }
        else if (!sign)
        {
            // (a >= b)
            (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, my_a, wordsize, my_a, wordsize, my_b, wordsize);
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct0, my_a, wordsize, my_a, wordsize);
            Cy_Cryptolite_EC_SubMod(base, cfContext, z, z, my_v);
            Cy_Cryptolite_EC_HalfMod(base, cfContext, z, z);

        }
        else
        {
            (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, my_b, wordsize, my_b, wordsize, my_a, wordsize);
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct0, my_b, wordsize, my_b, wordsize);
            Cy_Cryptolite_EC_SubMod(base, cfContext, my_v, my_v, z);
            Cy_Cryptolite_EC_HalfMod(base, cfContext, my_v, my_v);

        }

    }
}

/*
 @brief (X,Y)-only co-Z addition with update: Calculate P+Q and P' (co-Z with P+Q)
 Algorithm 5, "Fast and regular algorithms for scalar multiplication over elliptic curves"

 @param[in, out] x1/x3  : input X-coordinate of P (Jacobian, projective coordinate) and output X-coordinate of P+Q
 @param[in, out] y1/y3  : input Y-coordinate of P (Jacobian, projective coordinate) and output Y-coordinate of P+Q
 @param[in, out] x2/x1' : input X-coordinate of Q (Jacobian, projective coordinate) and output X-coordinate of P'
 @param[in, out] y2/y1' : input Y-coordinate of Q (Jacobian, projective coordinate) and output Y-coordinate of P'
 where P = (x1, y1, z), Q = (x2, y2, z), P+Q = (x3,y3,z3) and P' = (x1',y1',z3), for some z3 on the elliptic curve

 @param[in] barrett_u :  Register index for Barrett reduction value.
 @param[in] mod :        Register index for modulo value.
 @param[in] size :       Bit size.
*/
void Cy_Cryptolite_EC_XYCZ_ADD(CRYPTOLITE_Type *base,
                               cy_stc_cryptolite_context_ecdsa_t *cfContext,
                               int carry,
                               uint8_t *x1,
                               uint8_t *y1,
                               uint8_t *x2,
                               uint8_t *y2,
                               int size);
void Cy_Cryptolite_EC_XYCZ_ADD(CRYPTOLITE_Type *base,
                               cy_stc_cryptolite_context_ecdsa_t *cfContext,
                               int carry,
                               uint8_t *x1,
                               uint8_t *y1,
                               uint8_t *x2,
                               uint8_t *y2,
                               int size)
{
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t2[VU_BITS_TO_BYTES(BIT_SIZE)];
    uint8_t *temp;

    Cy_Cryptolite_Vu_wait_hw(base);
    // Swap if carry set, b = 1 : (R0, R1) <- ADDC(R1, R0)
    if ((bool)carry)
    {
        temp = x1;
        x1 = x2;
        x2 = temp;

