PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_nist_p.c
        temp = y1;
        y1 = y2;
        y2 = temp;
    }

    Cy_Cryptolite_EC_SubMod(base, cfContext, t1, x1, x2);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, t1, t1, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, t2, x1, t1, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, x2, x2, t1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, t1, y1, y2);
    Cy_Cryptolite_EC_SubMod(base, cfContext, x1, t2, x2);
    Cy_Cryptolite_EC_MulMod(base, cfContext, y2, y2, x1, size);
    Cy_Cryptolite_EC_AddMod(base, cfContext, x1, x2, t2);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, t2, t1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, x1, t2, x1);
    Cy_Cryptolite_EC_SubMod(base, cfContext, t2, x2, x1);
    Cy_Cryptolite_EC_MulMod(base, cfContext, t1, t1, t2, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, y1, t1, y2);
}

/*
 @brief (X,Y)-only co-Z conjugate addition with update: Calculate P+Q and P-Q, which are co-Z
 Algorithm 6, "Fast and regular algorithms for scalar multiplication over elliptic curves"

 @param[in]      carry  : input carry flag, value = element of {0,1}
 @param[in, out] x1,x3  : input X-coordinate of R0, my_r0_x (Jacobian, projective coordinate) and output X-coordinate of P+Q
 @param[in, out] y1,y3  : input Y-coordinate of R0, my_r0_y (Jacobian, projective coordinate) and output Y-coordinate of P+Q
 @param[in, out] x2,x3' : input X-coordinate of R1, my_r1_x (Jacobian, projective coordinate) and output X-coordinate of P-Q
 @param[in, out] y2,y3' : input Y-coordinate of R1, my_r1_y (Jacobian, projective coordinate) and output Y-coordinate of P-Q
 where P = (x1, y1, z), Q = (x2, y2, z), P+Q = (x3,y3,z3) and P-Q = (x3',y3',z3), for some z3 on the elliptic curve

 @param[in] barrett_u :  Register index for Barrett reduction value.
 @param[in] mod :        Register index for modulo value.
 @param[in] size :       Bit size.
*/
void Cy_Cryptolite_EC_XYCZ_ADDC(CRYPTOLITE_Type *base,
                                cy_stc_cryptolite_context_ecdsa_t *cfContext,
                                int carry,
                                uint8_t *x1,
                                uint8_t *y1,
                                uint8_t *x2,
                                uint8_t *y2,
                                int size);
void Cy_Cryptolite_EC_XYCZ_ADDC(CRYPTOLITE_Type *base,
                                cy_stc_cryptolite_context_ecdsa_t *cfContext,
                                int carry,
                                uint8_t *x1,
                                uint8_t *y1,
                                uint8_t *x2,
                                uint8_t *y2,
                                int size)
{
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t2[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t3[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t4[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t5[VU_BITS_TO_BYTES(BIT_SIZE)];
    uint8_t *temp;

    Cy_Cryptolite_Vu_wait_hw(base);
    // Swap if carry set, b = 1 : (R0, R1) <- ADDC(R1, R0)
    if ((bool)carry)
    {
        temp = x1;
        x1 = x2;
        x2 = temp;

        temp = y1;
        y1 = y2;
        y2 = temp;
    }

    Cy_Cryptolite_EC_SubMod(base, cfContext, t1, x2, x1);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, t1, t1, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, t2, x2, t1, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, t3, x1, t1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, t1, y2, y1);
    Cy_Cryptolite_EC_AddMod(base, cfContext, t5, y1, y2);
    Cy_Cryptolite_EC_SubMod(base, cfContext, x2, t2, t3);
    Cy_Cryptolite_EC_MulMod(base, cfContext, y1, y1, x2, size);
    Cy_Cryptolite_EC_AddMod(base, cfContext, t2, t3, t2);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, x2, t1, size);



    Cy_Cryptolite_EC_SubMod(base, cfContext, x2, x2, t2);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, t4, t5, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, x1, t3, x2);
    Cy_Cryptolite_EC_MulMod(base, cfContext, x1, t1, x1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, y2, x1, y1);
    Cy_Cryptolite_EC_SubMod(base, cfContext, x1, t4, t2);
    Cy_Cryptolite_EC_SubMod(base, cfContext, t1, x1, t3);
    Cy_Cryptolite_EC_MulMod(base, cfContext, t3, t5, t1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, y1, t3, y1);

    Cy_Cryptolite_Vu_wait_hw(base);
    temp = y1;
    y1 = y2;
    y2 = temp;
}

/* @brief Elliptic curve point multiplication, in GF(p), using (X,Y)-only, co-Z arithmetic.
 @param[in] s_x          Register index for affine X coordinate of base point.
 @param[in] s_y          Register index for affine Y coordinate of base point.
 @param[in] d            Register index for multiplication/exponentiation value.
 @param[in] barrett_u        Register index for Barrett reduction value.
 @param[in] mod          Register index for modulo value.
 @param[in] size             Bit size.
*/
void Cy_Cryptolite_EC_JacobianEcScalarMul_coZ(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *px,
        uint8_t *py,
        uint8_t *pd,
        int size,  // bit size
        uint8_t *porder);
void Cy_Cryptolite_EC_JacobianEcScalarMul_coZ(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *px,
        uint8_t *py,
        uint8_t *pd,
        int size,  // bit size
        uint8_t *porder)
{
    int i;
    uint8_t carry;
    uint8_t carry_sizeplus1;
    uint8_t carry_size;
    uint8_t carry_sizeminus1;
    bool carry_combination;
    CY_ALIGN(4) uint8_t dc[VU_BITS_TO_BYTES(BIT_SIZE + 2)];
    CY_ALIGN(4) uint8_t lambda[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_r1_x[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_r1_y[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_p_x[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t my_p_y[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t2[VU_BITS_TO_BYTES(BIT_SIZE)];
    CY_ALIGN(4) uint8_t t3[VU_BITS_TO_BYTES(BIT_SIZE)];

