PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_nist_p.c
    uint8_t *p_my_r1_x = my_r1_x;
    uint8_t *p_my_r1_y = my_r1_y;
    uint8_t *p_t1 = t1;
    uint8_t *p_t2 = t2;

    uint8_t *p_t3 = t3;
    uint8_t *t4 = porder;
    uint8_t *p_t4 = t4;

    uint8_t *temp;
    int even_size;
    uint32_t bitsize = cfContext->bitsize;
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];


    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, my_p_x, VU_BITS_TO_WORDS(bitsize), px, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, my_p_y, VU_BITS_TO_WORDS(bitsize), py, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), pd, VU_BITS_TO_WORDS(bitsize));

    Cy_Cryptolite_Vu_wait_hw(base);

    if (Cy_Cryptolite_Vu_test_even(dc) == false)
    {
        (void)Cy_Cryptolite_Vu_add_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U), porder, VU_BITS_TO_WORDS(bitsize));
    }

    (void)Cy_Cryptolite_Vu_add_hw(base, vu_struct1, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U), porder, VU_BITS_TO_WORDS(bitsize));




    /*------------------------------------------------
    * Montgomery ladder with (X,Y)-only co-Z addition
    *------------------------------------------------
    * Initialization function
    * Calculate 2P, corresponding to leading 1 in dc
    * Ensures constant timing looping over all bits in dc, which can vary in the number of bits over the range [size, size_2]
    *Crypto_EC_CoZ_Init    (dc, my_p_x, my_p_y, px, py, p_my_r1_x, my_r1_y, size);
    */

    /*--------------------------------
    * IDBL: 2P and P*
    *---------------------------------
    */


    Cy_Cryptolite_EC_SquareMod(base, cfContext, p_my_r1_y, my_p_y, size);
    Cy_Cryptolite_EC_AddMod(base, cfContext, p_my_r1_y, p_my_r1_y,    p_my_r1_y);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, py, p_my_r1_y, size);
    Cy_Cryptolite_EC_AddMod(base, cfContext, py, py, py);
    Cy_Cryptolite_EC_AddMod(base, cfContext, px, p_my_r1_y, p_my_r1_y);
    Cy_Cryptolite_EC_MulMod(base, cfContext, px, px, my_p_x, size);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, p_my_r1_x, my_p_x, size);
    Cy_Cryptolite_EC_AddMod(base, cfContext, p_my_r1_y, p_my_r1_x, p_my_r1_x);
    Cy_Cryptolite_EC_AddMod(base, cfContext, p_my_r1_x, p_my_r1_y, p_my_r1_x);
    Cy_Cryptolite_Vu_wait_hw(base);
    Cy_Cryptolite_Vu_clr(p_t1, VU_BITS_TO_WORDS(bitsize));
    Cy_Cryptolite_Vu_set_bit(p_t1, 0);
    Cy_Cryptolite_Vu_set_bit(p_t1, 1);



    Cy_Cryptolite_EC_SubMod(base, cfContext, p_my_r1_y, p_my_r1_x, p_t1);
    Cy_Cryptolite_EC_SquareMod(base, cfContext, p_my_r1_x, p_my_r1_y, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, p_my_r1_x, p_my_r1_x, px);
    Cy_Cryptolite_EC_SubMod(base, cfContext, p_my_r1_x, p_my_r1_x, px);
    Cy_Cryptolite_EC_SubMod(base, cfContext, p_t1, px, p_my_r1_x);
    Cy_Cryptolite_EC_MulMod(base, cfContext, p_my_r1_y, p_my_r1_y, p_t1, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, p_my_r1_y, p_my_r1_y, py);
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, p_t1, VU_BITS_TO_WORDS(bitsize), p_my_r1_x, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, p_t2, VU_BITS_TO_WORDS(bitsize), p_my_r1_y, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, p_t3, VU_BITS_TO_WORDS(bitsize), px, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, p_t4, VU_BITS_TO_WORDS(bitsize), py, VU_BITS_TO_WORDS(bitsize));



    /*--------------------------------
    * b_{s+1}
    *--------------------------------
    */
    carry_sizeplus1 = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
    (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));


    /*--------------------------------
    * b_{s}
    *--------------------------------
    */

    if (!(bool)carry_sizeplus1)
    {
        temp = px;
        px = p_t1;
        p_t1 = temp;

        temp = py;
        py = p_t2;
        p_t2 = temp;

        temp = p_my_r1_x;
        p_my_r1_x = p_t3;
        p_t3 = temp;

        temp = p_my_r1_y;
        p_my_r1_y = p_t4;
        p_t4 = temp;
    }

    Cy_Cryptolite_Vu_wait_hw(base);
    carry_size = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
    (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct1, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));



    Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry_size, px, py, p_my_r1_x, p_my_r1_y, size);



    Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry_size, px, py, p_my_r1_x, p_my_r1_y, size);



    carry_combination = ((!(bool)carry_sizeplus1) && (bool)carry_size);

    if (carry_combination)
    {
        temp = px;
        px = p_t1;
        p_t1 = temp;

        temp = py;
        py = p_t2;
        p_t2 = temp;

        temp = p_my_r1_x;
        p_my_r1_x = p_t3;
        p_t3 = temp;

        temp = p_my_r1_y;
        p_my_r1_y = p_t4;
        p_t4 = temp;
    }

    carry_sizeminus1 = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1U;
    (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));
    Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry_sizeminus1, px, py, p_my_r1_x, p_my_r1_y, size);
    Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry_sizeminus1, px, py, p_my_r1_x, p_my_r1_y, size);

    carry_combination = !(bool)carry_sizeplus1 && !(bool)carry_size && (bool)carry_sizeminus1;

    if (carry_combination)
    {
        temp = px;
        px = p_t1;
        p_t1 = temp;

        temp = py;
        py = p_t2;
        p_t2 = temp;

        temp = p_my_r1_x;
        p_my_r1_x = p_t3;
        p_t3 = temp;

        temp = p_my_r1_y;
        p_my_r1_y = p_t4;
        p_t4 = temp;
    }

    even_size = (bool)(size % 2) ? (size - 1) : size;
    for (i = 0; i < (even_size - 2); i += 2)
    {
        carry = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct1, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));
        Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
        Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);

        carry = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));
        Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
        Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
    }

