PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_nist_p.c
    if (!(bool)even_size)
    {
        carry = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct1, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));
        Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
        Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
    }

    carry = (dc[VU_BITS_TO_BYTES(bitsize + 2U) - 4U] & (0x2U)) >> 1;
    (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, dc, VU_BITS_TO_WORDS(bitsize + 2U), dc, VU_BITS_TO_WORDS(bitsize + 2U));

    Cy_Cryptolite_EC_XYCZ_ADDC(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);
    Cy_Cryptolite_EC_SubMod(base, cfContext, p_t1, p_my_r1_x, px);
    Cy_Cryptolite_EC_MulMod(base, cfContext, p_t1, p_t1, my_p_x, size);

    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, p_t2, VU_BITS_TO_WORDS(bitsize), px, VU_BITS_TO_WORDS(bitsize));
    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, p_t3, VU_BITS_TO_WORDS(bitsize), py, VU_BITS_TO_WORDS(bitsize));

    /* Swap values if carry bit is set to 1 */
    if ((bool)carry)
    {
        p_t2 = p_my_r1_x;
        p_t3 = p_my_r1_y;
    }

    Cy_Cryptolite_EC_MulMod(base, cfContext, p_t3, p_t1, p_t3, size);
    Cy_Cryptolite_Vu_wait_hw(base);

    Cy_Cryptolite_Vu_clr(p_t1, VU_BITS_TO_WORDS(bitsize));
    Cy_Cryptolite_Vu_set_bit(p_t1, 0);

    Cy_Cryptolite_EC_DivMod(base, cfContext, p_t3, p_t1, p_t3, (int)size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, p_t1, my_p_y, p_t3, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, lambda, p_t2, p_t1, size);
    Cy_Cryptolite_EC_XYCZ_ADD(base, cfContext, (int)carry, px, py, p_my_r1_x, p_my_r1_y, size);

    Cy_Cryptolite_EC_SquareMod(base, cfContext, my_p_x, lambda, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, lambda, my_p_x, lambda, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, px, px, my_p_x, size);
    Cy_Cryptolite_EC_MulMod(base, cfContext, py, py, lambda, size);
}

/**
* @brief Elliptic curve point multiplication in GF(p)
* @param[in] p_x        Register index for affine X coordinate of base point.
* @param[in] p_y        Register index for affine Y coordinate of base point.
* @param[in] p_d        Register index for multiplication value.
* @param[in] p_order    Register index for order value.
* @param[in] bitsize    Bit size of the used curve.
*/
void Cy_Cryptolite_EC_NistP_PointMul(CRYPTOLITE_Type *base,
                                     cy_stc_cryptolite_context_ecdsa_t *cfContext,
                                     uint8_t *p_x, uint8_t *p_y,
                                     uint8_t *p_d, uint8_t *p_order,
                                     int bitsize)
{
    Cy_Cryptolite_EC_JacobianEcScalarMul_coZ(base, cfContext, p_x, p_y, p_d, bitsize, p_order);
    Cy_Cryptolite_Vu_wait_hw(base);
}


#endif /* #if defined(CY_CRYPTOLITE_CFG_ECP_C) */
#endif /* #if (CPUSS_CRYPTOLITE_VU == 1) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTOLITE */


